data/Parm_PH_29/alpha_10/alpha_10_9000_3036/0/C
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
15600
(
(0.0400330677499857 1.00195548402226 4.5081459984988e-18)
(0.120088910350581 1.00097048511695 2.34983910559452e-18)
(0.199841057814651 0.994974480673114 -2.35713811931165e-18)
(0.27807520774011 0.979070260531427 -2.49389676002149e-18)
(0.352737713971927 0.950972127584057 7.27521337652649e-18)
(0.422713421969036 0.912370571264765 2.55783813983031e-18)
(0.488708739938703 0.867146412944739 0)
(0.551975946147586 0.818141636643536 9.4182099318929e-20)
...
)
;

boundaryField
{
    bottomWall
    {
        type            calculated;
        value           nonuniform List<vector> 
120
(
(0.0400380308287192 1 0)
(0.120091432314613 0.999013374143257 0)
(0.199802785076396 0.993013179579146 0)
(0.27797179055355 0.977107727124725 0)
(0.352561181409551 0.949014702829256 0)
(0.422485814336024 0.910395842168583 0)
(0.488447664364186 0.865121480646175 0)
(0.551690440051809 0.81604002000439 0)
...
)
;
    }
    topWall
    {
        type            calculated;
        value           nonuniform List<vector> 
120
(
(0.0375 3.036 0)
(0.1125 3.036 0)
(0.1875 3.036 0)
(0.2625 3.036 0)
(0.3375 3.036 0)
(0.4125 3.036 0)
(0.4875 3.036 0)
(0.5625 3.036 0)
...
)
;
    }
    inlet_half0
    {
        type            cyclic;
    }
    inlet_half1
    {
        type            cyclic;
    }
    outlet_half0
    {
        type            cyclic;
    }
    outlet_half1
    {
        type            cyclic;
    }
    sideRight_half0
    {
        type            empty;
    }
    sideRight_half1
    {
        type            empty;
    }
    sideLeft_half0
    {
        type            empty;
    }
    sideLeft_half1
    {
        type            empty;
    }
}


// ************************************************************************* //
