data/Parm_PH_29/alpha_10/alpha_10_9000_3036/0/tauij_LES
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      tauij_LES;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<symmTensor>
15600
(
(0.00508441 -0.00006462 0.00000000 0.00002297 0.00000000 0.00328858)
(0.00597970 -0.00003332 0.00000000 -0.00001253 0.00000000 0.00344467)
(0.00143971 -0.00084272 0.00000000 0.00056968 0.00000000 0.00370849)
(0.00083330 0.00012535 0.00000000 -0.00010064 0.00000000 0.00072826)
(0.00066853 -0.00036139 0.00000000 0.00022495 0.00000000 0.00073189)
(0.00197323 -0.00147488 0.00000000 0.00106485 0.00000000 0.00275596)
(0.00384339 -0.00278097 0.00000000 0.00211008 0.00000000 0.00513590)
(0.00143295 -0.00101930 0.00000000 0.00071566 0.00000000 0.00181371)
...
)
;

boundaryField
{
    bottomWall
    {
        type        fixedValue;
        value       uniform (0 0 0 0 0 0);
    }
    topWall
    {
        type        fixedValue;
        value       uniform (0 0 0 0 0 0);
    }
    inlet_half0
    {
        type        cyclic;
    }
    inlet_half1
    {
        type        cyclic;
    }
    outlet_half0
    {
        type        cyclic;
    }
    outlet_half1
    {
        type        cyclic;
    }
    sideRight_half0
    {
        type        empty;
    }
    sideRight_half1
    {
        type        empty;
    }
    sideLeft_half0
    {
        type        empty;
    }
    sideLeft_half1
    {
        type        empty;
    }
}

// ************************************************************************* //
